# 1. 라이브러리와 프레임워크
- 개발 흐름의 주도권을 누가 가지고 있는지의 차이가 크다
- 라이브러리는 자신에게 필요한 기능만 사용. 개발 주도권이 개발자에게 있음.
- 웹 개발을 시작하는 방법부터 기능을 구현하는 모든 것을 프레임워크에서 정해 놓은 대로 따라야 한다. 프레임워크는 개발 주도권이 프레임워크에게 있음. 

# 2.자바스크립트의 라이브러리와 프레임워크
- 제이쿼리 : DOM을 활용해 웹 요소를 조작하기 쉽고 사용하기 편리한 라이브러리
- D3.js : 웹 브라우저에서 실시간으로 변하는 정보를 시각적으로 표시하기에 적합한 라이브러리
- 부트스트랩 : 웹 사이트 디자인을 쉽게 만들어 주는 라이브러리
- 리액트 : 페이스북처럼 한 화면에서 모든 내용을 볼 수 있는 사이트(SPA)나 복잡한 사이트를 개발할 때 많이 사용하는 프레임워크. 페이스북에서 개발
- 앵귤러 : 웹 애플리케이션을 제작하는 프레임워크. 구글에서 개발
- 뷰 : 웹 애플리케이션에서 사용자 인터페이스를 만드는 프레임워크. 화면에 보이는 부분에만 초점을 맞추기 때문에 다른 라이브러리나 프레임워크와 함께 사용 가능

# 3. 백엔드 개발의 언어와 프레임워크는
- Node.js, Express : 자바스크립트에 익숙한 경우 손쉽게 사용 가능. Node.js는 서버에서 자바스크립트를 실행할 수 있는 환경. Node.js에서 주로 사용하는 웹 개발 프레임워크가 Express
- Java, Spring : 앱 개발, 하드웨어용 프로그램 등에 범용적으로 사용되는 Java. Java에서 웹 개발 프레임워크는 스프링을 가장 많이 사용함.
- 파이썬, 장고(Django) : 개발하기 쉽고 데이터를 다룰 때 많이 사용되는 언어. 인터프리터 언어이며 속도가 느리다는 가장 큰 단점이 있음. 웹 개발 프레임워크로 장고를 많이 사용
- PHP, 코드이그나이터 : PHP 7 버전부터 백엔드 개발을 위한 프레임워크로 변경. PHP의 웹 프레임워크가 코드이그나이터.
